app/controllers/places_controller.rb

SELECT places.*, (69.09332411348201 * ABS(places.latitude - 29.7901812) * 0.7071067811865475) + (59.836573914187355 * ABS(places.longitude - -95.36778439999999) * 0.7071067811865475) AS distance, CASE WHEN (places.latitude >= 29.7901812 AND places.longitude >= -95.36778439999999) THEN  45.0 WHEN (places.latitude <  29.7901812 AND places.longitude >= -95.36778439999999) THEN 135.0 WHEN (places.latitude <  29.7901812 AND places.longitude <  -95.36778439999999) THEN 225.0 WHEN (places.latitude >= 29.7901812 AND places.longitude <  -95.36778439999999) THEN 315.0 END AS bearing FROM "places" WHERE (places.latitude BETWEEN 29.06652228444576 AND 30.51384011555424 AND places.longitude BETWEEN -96.20163634353865 AND -94.53393245646133) ORDER BY "places"."distance" ASC
---
  def index
      if params[:search].present?
        @places = Place.near(params[:search], 50, :order => :distance)
      else
        @places = Place.all

SELECT places.*, (69.09332411348201 * ABS(places.latitude - 29.759454) * 0.7071067811865475) + (59.836573914187355 * ABS(places.longitude - -95.3699335) * 0.7071067811865475) AS distance, CASE WHEN (places.latitude >= 29.759454 AND places.longitude >= -95.3699335) THEN  45.0 WHEN (places.latitude <  29.759454 AND places.longitude >= -95.3699335) THEN 135.0 WHEN (places.latitude <  29.759454 AND places.longitude <  -95.3699335) THEN 225.0 WHEN (places.latitude >= 29.759454 AND places.longitude <  -95.3699335) THEN 315.0 END AS bearing FROM "places" WHERE (places.latitude BETWEEN 29.614722216889152 AND 29.90418578311085 AND places.longitude BETWEEN -95.53665272744705 AND -95.20321427255296 AND places.id != 17) ORDER BY distance ASC
---
  def show
    @place = Place.find(params[:id])

INSERT INTO "places" ("title", "address", "created_at", "updated_at", "category") VALUES (?, ?, ?, ?, ?)  [["title", "Shadi House"], ["address", "811 Wilkes Street, 77009"], ["created_at", 2017-01-05 18:37:07 UTC], ["updated_at", 2017-01-05 18:37:07 UTC], ["category", "Home"]]
---
  def create
    @place = @trip.Place.new(place_params)

    respond_to do |format|
      if @place.save

DELETE FROM "places" WHERE "places"."id" = ?  [["id", 1]]
---
  def destroy
    @place.destroy