app/controllers/trips_controller.rb

  def index
    @trips = Trip.order('created_at DESC')
---
SELECT "trips".* FROM "trips" ORDER BY created_at DESC

  def show
    @user = User.find(current_user[:id])
    @trip = Trip.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @user = User.find(current_user[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @user = User.find(current_user[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @trip.user_id = current_user.id
    @trip = @trip.user_id.trip.new(trip_params)

    respond_to do |format|
      if @trip.save
---
INSERT INTO "trips" ("start_date", "end_date", "trip_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["start_date", 2017-01-06 10:00:00 UTC], ["end_date", 2017-01-10 18:30:00 UTC], ["trip_name", "January Trip Test"], ["created_at", 2017-01-06 18:36:34 UTC], ["updated_at", 2017-01-06 18:36:34 UTC]]

    def set_trip
      @trip = Trip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]